# PANDAS

`pandas` is an open source library which provides data analysis tools for python programming language.It is built on top of `numpy` library which means it needs `numpy` to operate

## DataFrame

* It is a datastructure in pandas library
* DataFrame is a 2 Dimensional array which consists of rows and columns(tabular data)

In [3]:
import pandas as pd   #import pandas

Structure:

pd.DataFrame(data, index, columns, dtype, copy)

* Parameters of DataFrame:
    * data – The data from which the dataframe will be made
    * index – States the index from dataframe
    * columns – States the column label
    * dtype – The datatype for the dataframe
    * copy – Any copied data taken from inputs

## CREATION OF DATAFRAME

* A pandas DataFrame can be created using :

    * Lists
    * dict
    * list of dicts
    * Another DataFrame

### Empty DataFrame

In [8]:
df=pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [9]:
print(df)

Empty DataFrame
Columns: []
Index: []

### Using Lists

In [11]:
#ex-1
data=[5,4,3,2,1,0]
df=pd.DataFrame(data)
df

   0
0  5
1  4
2  3
3  2
4  1
5  0

In [13]:
#ex-2
data=[['Hyderabad',30],['Banglore',25],['chennai',40]]
df=pd.DataFrame(data,columns=['Place','Temp'])
df

       Place  Temp
0  Hyderabad    30
1   Banglore    25
2    chennai    40

### Using Dict

In [17]:
data={'place':['Hyderabad','Banglore','Chennai'],'Temp':[30,25,40]}
df=pd.DataFrame(data)
df

       place  Temp
0  Hyderabad    30
1   Banglore    25
2    Chennai    40

In [18]:
## indexed dataframe using arrays

In [20]:
data={'place':['Hyderabad','Banglore','Chennai'],'Temp':[30,25,40]}
df=pd.DataFrame(data,index=[1,2,3])
df

       place  Temp
1  Hyderabad    30
2   Banglore    25
3    Chennai    40

### Using List of Dicts

In [11]:
data = [{'Hyderabad':33, 'Banglore': 23},{'Hyderabad': 30, 'Banglore': 27}]
df = pd.DataFrame(data,index=['Day1','Day2'])
df

      Banglore  Hyderabad
Day1        23         33
Day2        27         30

### Using Another DataFrame

#### append

This `append` function will add new rows to a DataFrame

In [18]:
import pandas as pd

df1= pd.DataFrame([[33,23]], columns = ['Hyderabad','Banglore'],index=['Day1'])
df2 = pd.DataFrame([[30,27]], columns = ['Hyderabad','Banglore'],index=['Day2'])

df = df1.append(df2)
df

      Hyderabad  Banglore
Day1         33        23
Day2         30        27

#### drop

This `drop` function will delete the specified rows in a DataFrame

In [22]:
import pandas as pd

df1= pd.DataFrame([[33,23]], columns = ['Hyderabad','Banglore'],index=['Day1'])
df2 = pd.DataFrame([[30,27]], columns = ['Hyderabad','Banglore'],index=['Day2'])

df = df1.append(df2)
df=df.drop('Day2') #drop the day2 axes
df

      Hyderabad  Banglore
Day1         33        23

## ATTRIBUTES/METHODS IN A DATAFRAME:

* some of the attributes to be noted in dataframe:
    * T(Transpose)
    * axes
    * dtypes
    * empty
    * ndim
    * shape
    * size
    * values
    * head
    * tail

In [28]:
## create a DataFrame

In [29]:
data={'place':['Hyderabad','Banglore','Chennai'],
      'Temp':[30,25,40],
      'event':['Rainy','snowy','sunny']
     }
df=pd.DataFrame(data)
df

       place  Temp  event
0  Hyderabad    30  Rainy
1   Banglore    25  snowy
2    Chennai    40  sunny

## Transpose(T)

This will interchange rows and columns

In [32]:
data={'place':['Hyderabad','Banglore','Chennai'],
      'Temp':[30,25,40],
      'event':['Rainy','snowy','sunny']
     }
df=pd.DataFrame(data)
df.T

               0         1        2
place  Hyderabad  Banglore  Chennai
Temp          30        25       40
event      Rainy     snowy    sunny

## axes
This will return the row axis labels and column axis labels

In [33]:
data={'place':['Hyderabad','Banglore','Chennai'],
      'Temp':[30,25,40],
      'event':['Rainy','snowy','sunny']
     }
df=pd.DataFrame(data)
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['place', 'Temp', 'event'], dtype='object')]

## dtypes

This will return the datatypes of each column

In [34]:
data={'place':['Hyderabad','Banglore','Chennai'],
      'Temp':[30,25,40],
      'event':['Rainy','snowy','sunny']
     }
df=pd.DataFrame(data)
df.dtypes

place    object
Temp      int64
event    object
dtype: object

## empty

This will return a boolean value True/False based on the object value empty or not

In [35]:
data={'place':['Hyderabad','Banglore','Chennai'],
      'Temp':[30,25,40],
      'event':['Rainy','snowy','sunny']  #object is not empty,so it returns False
     }
df=pd.DataFrame(data)
df.empty

False

## ndim
This will return the no.of dimensions of the object

In [37]:
data={'place':['Hyderabad','Banglore','Chennai'],
      'Temp':[30,25,40],
      'event':['Rainy','snowy','sunny']  #It returns 2 as the DataFrame structure is a 2D object
     }
df=pd.DataFrame(data)
df.ndim

2

## shape
This will return the dimensionality of the dataframe

In [38]:
data={'place':['Hyderabad','Banglore','Chennai'],
      'Temp':[30,25,40],
      'event':['Rainy','snowy','sunny'] 
     }
df=pd.DataFrame(data)
df.shape

(3, 3)

## size
This will return the no.of elements present in a dataframe

In [40]:
data={'place':['Hyderabad','Banglore','Chennai'],
      'Temp':[30,25,40],
      'event':['Rainy','snowy','sunny'] 
     }
df=pd.DataFrame(data)
df.size

9

## values
This will return the actual data in a dataframe

In [41]:
data={'place':['Hyderabad','Banglore','Chennai'],
      'Temp':[30,25,40],
      'event':['Rainy','snowy','sunny'] 
     }
df=pd.DataFrame(data)
df.values

array([['Hyderabad', 30, 'Rainy'],
       ['Banglore', 25, 'snowy'],
       ['Chennai', 40, 'sunny']], dtype=object)

## head()
This will return the first n rows of the object
`n` may be any number given by the user

In [45]:
data={'place':['Hyderabad','Banglore','Chennai'],
      'Temp':[30,25,40],
      'event':['Rainy','snowy','sunny'] 
     }
df=pd.DataFrame(data)
df.head(2)  #here top2 rows are displayed

       place  Temp  event
0  Hyderabad    30  Rainy
1   Banglore    25  snowy

## tail()
This will return the last n rows of the object
`n` may be any number given by the user

In [49]:
data={'place':['Hyderabad','Banglore','Chennai'],
      'Temp':[30,25,40],
      'event':['Rainy','snowy','sunny'] 
     }
df=pd.DataFrame(data)
df.tail(2) #here last2 rows are displayed

      place  Temp  event
1  Banglore    25  snowy
2   Chennai    40  sunny

##  BASIC STATISTICAL FUNCTIONS
   * sum()
   * count()
   * mean()
   * median()
   * mode()
   * std()
   * min()
   * max()
   * abs()
   * prod()
   * cumsum()
   * cumprod()
   * describe()
   * unique()
   * value_counts()
   * info()

### sum()

In [50]:
data={'place':['Hyderabad','Banglore','Chennai'],
      'Temp':[30,25,40],
      'event':['Rainy','snowy','sunny'] 
     }
df=pd.DataFrame(data)
df.sum() #default--->axis=0

place    HyderabadBangloreChennai
Temp                           95
event             Rainysnowysunny
dtype: object

### count()

In [56]:
data={'place':['Hyderabad','Banglore','Chennai'],
      'Temp':[30,25,40],
      'event':['Rainy','snowy','sunny'] 
     }
df=pd.DataFrame(data)
df.count()

place    3
Temp     3
event    3
dtype: int64

### mean()

In [57]:
data={'place':['Hyderabad','Banglore','Chennai'],
      'Temp':[30,25,40],
      'event':['Rainy','snowy','sunny'] 
     }
df=pd.DataFrame(data)
df.mean()

Temp    31.666667
dtype: float64

### median()

In [58]:
data={'place':['Hyderabad','Banglore','Chennai'],
      'Temp':[30,25,40],
      'event':['Rainy','snowy','sunny'] 
     }
df=pd.DataFrame(data)
df.median()

Temp    30.0
dtype: float64

### mode()

returns the value which is more often

In [66]:
data={'place':['Hyderabad','Banglore','Chennai'],
      'Temp':[30,25,40],
      'event':['Rainy','snowy','sunny'] 
     }
df=pd.DataFrame(data)
df.mode()

       place  Temp  event
0   Banglore    25  Rainy
1    Chennai    30  snowy
2  Hyderabad    40  sunny

In [68]:
data={'mode':[1,2,2,2,4,5,6,3,1,5]}
df=pd.DataFrame(data)
df.mode()

   mode
0     2

### std()

In [69]:
data={'place':['Hyderabad','Banglore','Chennai'],
      'Temp':[30,25,40],
      'event':['Rainy','snowy','sunny'] 
     }
df=pd.DataFrame(data)
df.std()

Temp    7.637626
dtype: float64

### min()

In [71]:
data={'place':['Hyderabad','Banglore','Chennai'],
      'Temp':[30,25,40],
      'event':['Rainy','snowy','sunny'] 
     }
df=pd.DataFrame(data)
df.min()

place    Banglore
Temp           25
event       Rainy
dtype: object

### max()

In [72]:
data={'place':['Hyderabad','Banglore','Chennai'],
      'Temp':[30,25,40],
      'event':['Rainy','snowy','sunny'] 
     }
df=pd.DataFrame(data)
df.max()

place    Hyderabad
Temp            40
event        sunny
dtype: object

### abs()

In [75]:
data={'place':['Hyderabad','Banglore','Chennai'],
      'Temp':[30.1,25,40],
      'event':['Rainy','snowy','sunny'] 
     }
df=pd.DataFrame(data)
df.Temp.abs() #abs() applied on one column--Temp

0    30.1
1    25.0
2    40.0
Name: Temp, dtype: float64

### prod()

In [76]:
data={'place':['Hyderabad','Banglore','Chennai'],
      'Temp':[30,25,40],
      'event':['Rainy','snowy','sunny'] 
     }
df=pd.DataFrame(data)
df.prod()

Temp    30000
dtype: int64

### cumsum()

In [77]:
data={'place':['Hyderabad','Banglore','Chennai'],
      'Temp':[30,25,40],
      'event':['Rainy','snowy','sunny'] 
     }
df=pd.DataFrame(data)
df.cumsum()

                      place Temp            event
0                 Hyderabad   30            Rainy
1         HyderabadBanglore   55       Rainysnowy
2  HyderabadBangloreChennai   95  Rainysnowysunny

In [79]:
data={'a':[1,2,3],
      'b':[2,3,4],
      'c':[3,4,5]}
df=pd.DataFrame(data)
df.cumsum()

   a  b   c
0  1  2   3
1  3  5   7
2  6  9  12

### cumprod()

In [81]:
data={'place':['Hyderabad','Banglore','Chennai'],
      'Temp':[30,25,40],
      'event':['Rainy','snowy','sunny'] 
     }
df=pd.DataFrame(data)
df.Temp.cumprod()

0       30
1      750
2    30000
Name: Temp, dtype: int64

In [82]:
data={'a':[1,2,3],
      'b':[2,3,4],
      'c':[3,4,5]}
df=pd.DataFrame(data)
df.cumprod()

   a   b   c
0  1   2   3
1  2   6  12
2  6  24  60

### describe()

It provides the summary of data

In [90]:
data={'place':['Hyderabad','Banglore','Chennai'],
      'Temp':[30,25,40],
      'event':['Rainy','snowy','sunny'] 
     }
df=pd.DataFrame(data)
df.describe()

            Temp
count   3.000000
mean   31.666667
std     7.637626
min    25.000000
25%    27.500000
50%    30.000000
75%    35.000000
max    40.000000

### unique()

In [85]:
data={'place':['Hyderabad','Banglore','Chennai'],
      'Temp':[30,25,40],
      'event':['Rainy','snowy','sunny'] 
     }
df=pd.DataFrame(data)
df.Temp.unique()

array([30, 25, 40], dtype=int64)

In [89]:
data={'a':[1,2,3],
      'b':[2,3,3],  
      'c':[3,4,5]}
df=pd.DataFrame(data)
df.b.unique()  #provides unique elements of col-b

array([2, 3], dtype=int64)

### value_counts
It counts the no.of unique values

In [93]:
data={'place':['Hyderabad','Banglore','Chennai'],
      'Temp':[30,25,40],
      'event':['Rainy','snowy','sunny'] 
     }
df=pd.DataFrame(data)
df.Temp.value_counts()

30    1
25    1
40    1
Name: Temp, dtype: int64

In [94]:
data={'a':[1,2,3],
      'b':[2,3,3],  
      'c':[3,4,5]}
df=pd.DataFrame(data)
df.b.value_counts() #counts the unique values in col-b

3    2
2    1
Name: b, dtype: int64

### info()

In [97]:
data={'place':['Hyderabad','Banglore','Chennai'],
      'Temp':[30,25,40],
      'event':['Rainy','snowy','sunny'] 
     }
df=pd.DataFrame(data)
df.info() #provides the information regarding memory usage

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
place    3 non-null object
Temp     3 non-null int64
event    3 non-null object
dtypes: int64(1), object(2)
memory usage: 152.0+ bytes

## ACCESSING DATA

### Accessing columns

In [98]:
df.columns

Index(['place', 'Temp', 'event'], dtype='object')

### Accessing particular column

In [99]:
df.Temp

0    30
1    25
2    40
Name: Temp, dtype: int64

### Another way of accessing columns

In [104]:
df['Temp']

0    30
1    25
2    40
Name: Temp, dtype: int64

### Accessing Multiple columns

In [108]:
df[['place','event']]

       place  event
0  Hyderabad  Rainy
1   Banglore  snowy
2    Chennai  sunny

In [109]:
df['Temp'].sum()

95

## READ AND WRITE CSV and XLS FILES

### To read csv file

In [115]:
import pandas as pd
#df=pd.read_csv('filename.csv')
#df

### To read XLS file

In [ ]:
import pandas as pd
#df=pd.read_excel('filename.xlsx')
#df

### To write csv file

In [ ]:
import pandas as pd
#df.to_csv('newfilename.csv')

### To write XLS file

In [ ]:
import pandas as pd
#df.to_excel('newfilename.xlsx')

In [117]:
import pandas as pd
df=pd.read_csv('weather.csv')
df

       place  Temp  event
0  Hyderabad    30  Rainy
1   Banglore    25  snowy
2    Chennai    40  sunny

## INDEXING AND SELECTION OF DATA
   * loc()
   * iloc()

### Slicing a dataframe

In [119]:
df[:2]  #slicing can be done to retrieve the rows

       place  Temp  event
0  Hyderabad    30  Rainy
1   Banglore    25  snowy

with the help of loc() and iloc(), we can select certain rows

loc() uses string indices

iloc() uses integers

### loc()
It is a label based indexing

In [131]:
df.loc[1]

place    Banglore
Temp           25
event       snowy
Name: 1, dtype: object

In [136]:
df.loc[:2]   #using index to access data

       place  Temp  event
0  Hyderabad    30  Rainy
1   Banglore    25  snowy
2    Chennai    40  sunny

### iloc()
It is a integer based indexing

In [137]:
df.iloc[1]

place    Banglore
Temp           25
event       snowy
Name: 1, dtype: object

In [141]:
df.iloc[:2] #which is same as slicing mentioned above

       place  Temp  event
0  Hyderabad    30  Rainy
1   Banglore    25  snowy

## SORTING OF DATA

   * sort by index
   * sort by value

### sort by index

In [144]:
data={'place':['Hyderabad','Banglore','Chennai'],
      'Temp':[30,25,40],
      'event':['Rainy','snowy','sunny'] 
     }
df=pd.DataFrame(data,index=['c','a','b'])
df

       place  Temp  event
c  Hyderabad    30  Rainy
a   Banglore    25  snowy
b    Chennai    40  sunny

In [145]:
data={'place':['Hyderabad','Banglore','Chennai'],
      'Temp':[30,25,40],
      'event':['Rainy','snowy','sunny'] 
     }
df=pd.DataFrame(data,index=['c','a','b'])
df.sort_index()  ##sort according to index

       place  Temp  event
a   Banglore    25  snowy
b    Chennai    40  sunny
c  Hyderabad    30  Rainy

### sort by value

In [146]:
data={'place':['Hyderabad','Banglore','Chennai'],
      'Temp':[30,25,40],
      'event':['Rainy','snowy','sunny'] 
     }
df=pd.DataFrame(data)
df

       place  Temp  event
0  Hyderabad    30  Rainy
1   Banglore    25  snowy
2    Chennai    40  sunny

In [147]:
data={'place':['Hyderabad','Banglore','Chennai'],
      'Temp':[30,25,40],
      'event':['Rainy','snowy','sunny'] 
     }
df=pd.DataFrame(data)
df.sort_values(by='Temp') #sort according to the col-Temp

       place  Temp  event
1   Banglore    25  snowy
0  Hyderabad    30  Rainy
2    Chennai    40  sunny

## MISSING VALUES
* Missing values occur quite often in Real time Data 
* To handle missing data:
    * Imputation-The values are filled in place of missing data
    * omission-The invalid data present will be discarded
    * Analysis-By directly applying method unaffected by missing values

* In pandas we perform:
    * a.Find missing values
    * b.Replacing missing values

## a.Find Missing values
* Detects the Missing values
   * isnull()
   * notnull()

### isnull()

In [148]:
data={'place':['Hyderabad','Banglore','Chennai'],
      'Temp':[30,25,40],
      'event':['Rainy','snowy','sunny'] 
     }
df=pd.DataFrame(data)
df.isnull() #checks whether missing value is present or not
#Returns False if not present

   place   Temp  event
0  False  False  False
1  False  False  False
2  False  False  False

In [151]:
import numpy as np
import pandas as pd
data={'place':['Hyderabad','Banglore','Chennai'],
      'Temp':[30,np.nan,40], #missing value present in Col-Temp so returns False
                            #np.nan or None represent missing values 
      'event':['Rainy','snowy','sunny'] 
     }
df=pd.DataFrame(data)
df.isnull()

   place   Temp  event
0  False  False  False
1  False   True  False
2  False  False  False

### notnull()

In [153]:
data={'place':['Hyderabad','Banglore','Chennai'],
      'Temp':[30,25,40],
      'event':['Rainy','snowy','sunny'] 
     }
df=pd.DataFrame(data)
df.notnull() # checks whether missing value is not present
#Returns True if missing value is not present in data

   place  Temp  event
0   True  True   True
1   True  True   True
2   True  True   True

In [154]:
import numpy as np
import pandas as pd
data={'place':['Hyderabad','Banglore','Chennai'],
      'Temp':[30,np.nan,40], #missing value present in Col-Temp so returns True
                            #np.nan or None represent missing values 
      'event':['Rainy','snowy','sunny'] 
     }
df=pd.DataFrame(data)
df.isnull()

   place   Temp  event
0  False  False  False
1  False   True  False
2  False  False  False

## b.Replacing Missing values
   * fillna()
   * dropna()

### fillna()

It is used to fill missing values using specified method

In [155]:
import numpy as np
import pandas as pd
data={'place':['Hyderabad','Banglore','Chennai'],
      'Temp':[30,np.nan,40], #missing value present in Col-Temp 
                            #np.nan or None represent missing values 
      'event':['Rainy','snowy','sunny'] 
     }
df=pd.DataFrame(data)
df.fillna(0) #replace missing value with value=0

       place  Temp  event
0  Hyderabad  30.0  Rainy
1   Banglore   0.0  snowy
2    Chennai  40.0  sunny

### dropna()
Removes missing values

In [156]:
import numpy as np
import pandas as pd
data={'place':['Hyderabad','Banglore','Chennai'],
      'Temp':[30,np.nan,40], #missing value present in Col-Temp 
                            #np.nan or None represent missing values 
      'event':['Rainy','snowy','sunny'] 
     }
df=pd.DataFrame(data)
df.dropna() #drop the row where atleast one element is missing

       place  Temp  event
0  Hyderabad  30.0  Rainy
2    Chennai  40.0  sunny

## GROUPBY

In [173]:
import pandas as pd
data={'place':['Hyderabad','Banglore','Chennai','Delhi'],
     'Temp':[30,25,40,40],
     'event':['sunny','snowy','sunny','sunny']
     }
df=pd.DataFrame(data)
grouped=df.groupby(['Temp'])
grouped.groups #to view the groups

{25: Int64Index([1], dtype='int64'),
 30: Int64Index([0], dtype='int64'),
 40: Int64Index([2, 3], dtype='int64')}

In [174]:
import pandas as pd
data={'place':['Hyderabad','Banglore','Chennai','Delhi'],
     'Temp':[30,25,40,40],
     'event':['sunny','snowy','sunny','sunny']
     }
df=pd.DataFrame(data)
grouped=df.groupby(['event'])
grouped.groups #to view the groups

{'snowy': Int64Index([1], dtype='int64'),
 'sunny': Int64Index([0, 2, 3], dtype='int64')}

In [181]:
import pandas as pd
data={'place':['Hyderabad','Banglore','Chennai','Delhi'],
     'Temp':[30,25,40,40],
     'event':['sunny','snowy','sunny','sunny']
     }
df=pd.DataFrame(data)
grouped=df.groupby(['Temp'])
print(grouped)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001FE282A6BA8>

In [182]:
df=pd.read_csv('weather.csv')
df

       place  Temp  event
0  Hyderabad    30  sunny
1   Banglore    25  snowy
2    Chennai    40  sunny
3      Delhi    40  sunny

### Iterating through groups

In [176]:
import pandas as pd
data={'place':['Hyderabad','Banglore','Chennai','Delhi'],
     'Temp':[30,25,40,40],
     'event':['sunny','snowy','sunny','sunny']
     }
df=pd.DataFrame(data)
grouped=df.groupby(['Temp'])

for name,group in grouped:
    print(name)
    print(group)

25
      place  Temp  event
1  Banglore    25  snowy
30
       place  Temp  event
0  Hyderabad    30  sunny
40
     place  Temp  event
2  Chennai    40  sunny
3    Delhi    40  sunny

## MERGE DATAFRAMES

In [188]:
temp_df=pd.DataFrame({'place':['Hyderabad','Banglore','Chennai','Delhi'],
                      'Temp':[30,25,40,45]
    
})

temp_df

       place  Temp
0  Hyderabad    30
1   Banglore    25
2    Chennai    40
3      Delhi    45

In [187]:
humidity_df=pd.DataFrame({'place':['Hyderabad','Banglore','Chennai'],
                         'Humidity':[68,65,75]
                         
})


humidity_df

       place  Humidity
0  Hyderabad        68
1   Banglore        65
2    Chennai        75

In [189]:
##merge two dataframes without explicitly mentioning index

df=pd.merge(temp_df,humidity_df,on='place')
df

       place  Temp  Humidity
0  Hyderabad    30        68
1   Banglore    25        65
2    Chennai    40        75

In [191]:
#here we can observe that there is no row for place-Delhi
#This is an inner join
#if we want to mention row of place-Delhi

In [192]:
df=pd.merge(temp_df,humidity_df,on='place',how='outer')
df

       place  Temp  Humidity
0  Hyderabad    30      68.0
1   Banglore    25      65.0
2    Chennai    40      75.0
3      Delhi    45       NaN

In [ ]:
#this is an outer join 
#inner and outer join can be seen in SQL